app/Controllers/C_DetailDosen.php

SELECT *
FROM `datadosen`
WHERE `id` = '1'
SELECT *
FROM `riwayatpendidikan`
WHERE `dosen_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `riwayatpendidikan`
WHERE `dosen_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `riwayatmengajar`
WHERE `dosen_id` = '1'
SELECT *
FROM `riwayatmengajar`
WHERE `dosen_id` = '1'
---
    public function index($id)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('/login'));
        }

        $result = $this->DataDosen->getWhere(['id' => $id]);

        $pendidikan = $this->RiwayatPendidikan->getWhere(['dosen_id' => $id]);
        $countPendidikan = $this->RiwayatPendidikan->select('dosen_id')->where('dosen_id', $id)->countAllResults();
        $countMengajar = $this->RiwayatMengajar->select('dosen_id')->where('dosen_id', $id)->countAllResults();

        $mengajar = $this->RiwayatMengajar->getWhere(['dosen_id' => $id]);