app/Controllers/C_KaryaDosen.php

SELECT `nama`
FROM `datadosen`
WHERE `id` = '1'
SELECT *
FROM `karyadosen`
WHERE `dosen_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `karyadosen`
WHERE `dosen_id` = '1'
---
    public function index($id)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('/login'));
        }

        $dosen = $this->DataDosen->select('nama');
        $dosen = $this->DataDosen->getWhere(['id' => $id]);
        $karya = $this->KaryaDosen->getWhere(['dosen_id' => $id]);
        $countKarya = $this->KaryaDosen->select('dosen_id')->where('dosen_id', $id)->countAllResults();