app/Controllers/C_Login.php

SELECT *
FROM `user`
WHERE `username` = 'J3C119084'
 LIMIT 1
---
    public function addUser()
    {
        $nama = $this->request->getPost('nama');
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $password = password_hash($password, PASSWORD_DEFAULT);

        $dataUser = $this->User->where(['username' => $username])->first();