app/Controllers/C_MainPage.php

SELECT *
FROM `datadosen`
SELECT COUNT(*) AS `numrows`
FROM `datadosen`
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('/login'));
        }
        $dosens = $this->DataDosen->get();
        $data = [
            "title"     => 'Web Dosen | Home',
            "dosens"    => $dosens->getResult('array'),
            "count"     => $this->DataDosen->countAllResults(),