app/Controllers/C_Rekapitulasi.php

    public function index()
    {
        $rekapitulasiKompetensi = $this->SertifikatKompetensi->Rekapitulasi();
        $rekapitulasiPelatihan = $this->SertifikatPelatihan->Rekapitulasi();
        $rekapitulasiSeminar = $this->SertifikatSeminar->Rekapitulasi();
        $rekapitulasiWorkshop = $this->SertifikatWorkshop->Rekapitulasi();
        $rekapitulasiKaryaDosen = $this->KaryaDosen->Rekapitulasi();

        $data = [
            "title" => "Web Dosen | Rekapitulasi",
            "rekapitulasiKompetensis" => $rekapitulasiKompetensi->getResult('array'),
            "rekapitulasiPelatihans" => $rekapitulasiPelatihan->getResult('array'),
            "rekapitulasiSeminars" => $rekapitulasiSeminar->getResult('array'),
            "rekapitulasiWorkshops" => $rekapitulasiWorkshop->getResult('array'),
            "rekapitulasiKaryaDosens" => $rekapitulasiKaryaDosen->getResult('array'),
            "countKompetensi" => $this->SertifikatKompetensi->countAllResults(),
            "countPelatihan" => $this->SertifikatPelatihan->countAllResults(),
            "countSeminar" => $this->SertifikatSeminar->countAllResults(),
            "countWorkshop" => $this->SertifikatWorkshop->countAllResults(),
            "countKaryaDosen" => $this->KaryaDosen->countAllResults(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `sertifikatpelatihan`
SELECT COUNT(*) AS `numrows`
FROM `sertifikatkompetensi`
SELECT COUNT(*) AS `numrows`
FROM `sertifikatseminar`
SELECT COUNT(*) AS `numrows`
FROM `sertifikatworkshop`
SELECT COUNT(*) AS `numrows`
FROM `karyadosen`