app/Controllers/C_SertifikatKompetensi.php

    public function index($id)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('/login'));
        }

        $dosen = $this->DataDosen->select('nama');
        $dosen = $this->DataDosen->getWhere(['id' => $id]);
        $Kompetensi = $this->SertifikatKompetensi->getWhere(['dosen_id' => $id]);
        $countKompetensi = $this->SertifikatKompetensi->select('dosen_id')->where('dosen_id', $id)->countAllResults();
---
SELECT `nama`
FROM `datadosen`
WHERE `id` = '1'
SELECT *
FROM `sertifikatkompetensi`
WHERE `dosen_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `sertifikatkompetensi`
WHERE `dosen_id` = '1'