app/Models/M_KaryaDosen.php

    public function Rekapitulasi()
    {
        $query = $this->table('karyadosen')
        ->select('karyadosen.id, nama, nidn, nama_karya, tahun, jenis, jenis_bukti, nomor, tautan, sitasi')
        ->join('datadosen', 'datadosen.id = karyadosen.dosen_id');
        return $query->get();
---
SELECT `karyadosen`.`id`, `nama`, `nidn`, `nama_karya`, `tahun`, `jenis`, `jenis_bukti`, `nomor`, `tautan`, `sitasi`
FROM `karyadosen`
JOIN `datadosen` ON `datadosen`.`id` = `karyadosen`.`dosen_id`