app/Models/M_SertifikatKompetensi.php

SELECT `sertifikatkompetensi`.`id`, `nama_kompetensi`, `tahun_perolehan`, `sertifikat`, `nama`, `nidn`
FROM `sertifikatkompetensi`
JOIN `datadosen` ON `datadosen`.`id` = `sertifikatkompetensi`.`dosen_id`
---
    public function Rekapitulasi()
    {
        $query = $this->table('sertifikatkompetensi')
        ->select('sertifikatkompetensi.id, nama_kompetensi, tahun_perolehan, sertifikat, nama, nidn')
        ->join('datadosen', 'datadosen.id = sertifikatkompetensi.dosen_id');
        return $query->get();