app/Models/M_SertifikatWorkshop.php

    public function Rekapitulasi()
    {
        $query = $this->table('sertifikatworkshop')
        ->select('sertifikatworkshop.id, nama_kegiatan, tanggal_perolehan, sertifikat, nama, nidn')
        ->join('datadosen', 'datadosen.id = sertifikatworkshop.dosen_id');
        return $query->get();
---
SELECT `sertifikatworkshop`.`id`, `nama_kegiatan`, `tanggal_perolehan`, `sertifikat`, `nama`, `nidn`
FROM `sertifikatworkshop`
JOIN `datadosen` ON `datadosen`.`id` = `sertifikatworkshop`.`dosen_id`