app/Models/M_SertifikatSeminar.php

    public function Rekapitulasi()
    {
        $query = $this->table('sertifikatseminar')
        ->select('sertifikatseminar.id, nama_kegiatan, tanggal_perolehan, sertifikat, nama, nidn')
        ->join('datadosen', 'datadosen.id = sertifikatseminar.dosen_id');
        return $query->get();
---
SELECT `sertifikatseminar`.`id`, `nama_kegiatan`, `tanggal_perolehan`, `sertifikat`, `nama`, `nidn`
FROM `sertifikatseminar`
JOIN `datadosen` ON `datadosen`.`id` = `sertifikatseminar`.`dosen_id`