app/Models/M_SertifikatPelatihan.php

SELECT `sertifikatpelatihan`.`id`, `nama_kegiatan`, `tanggal_perolehan`, `sertifikat`, `nama`, `nidn`
FROM `sertifikatpelatihan`
JOIN `datadosen` ON `datadosen`.`id` = `sertifikatpelatihan`.`dosen_id`
---
    public function Rekapitulasi()
    {
        $query = $this->table('sertifikatpelatihan')
        ->select('sertifikatpelatihan.id, nama_kegiatan, tanggal_perolehan, sertifikat, nama, nidn')
        ->join('datadosen', 'datadosen.id = sertifikatpelatihan.dosen_id');
        return $query->get();